<template v-once>
  <div class="page-content home">
    <div class="container">
      <back-btn/>
      <div
        v-if="lang === 'ru'"
        class="content-text">
        <h2>Кто мы</h2>
        <p>Наш адрес сайта:
          <router-link
            exact
            tag="button"
            to="/"
            @click.native="$root.playAudio('click')">
            <span>https://words-mincer.top/</span>
          </router-link>
        </p>
        <h2>Какие личные данные мы собираем и почему мы их собираем</h2>
        <p>Список данных, которые могут храниться у нас:</p>
        <ul>
          <li>Имя</li>
          <li>Фамилия</li>
          <li>Email</li>
          <li>Фото</li>
        </ul>
        <p>Сохранение данных осуществляется с помощью сервиса Firebase. О политике конфиденциальности данного сервиса можно ознакомиться по следующей
          <a
            href="https://policies.google.com/privacy"
            target="_blank">ссылке.</a>
        </p>
        <h2>Встроенный контент с других сайтов</h2>
        <p>Страницы на этом сайте могут содержать встроенный контент (например видео, изображения, статьи и т.п.). Встроенный контент с других сайтов ведет себя так же, буд-то пользователь посетил другой сайт.</p>
        <p>Эти сайты могут собирать данные о вас, использовать файлы cookie, встроить дополнительные сторонние системы отслеживания и следить за вашей взаимодействием с этим встроенным содержанием, в частности отслеживать взаимодействие со встроенным содержанием, если у вас есть учетная запись и вы вошли на этот сайт.</p>
        <h2>Аналитика</h2>
        <p>На нашем сайте используется Google Analytics. О политике конфиденциальности данного сервиса можно ознакомиться по следующей
          <a
            href="//policies.google.com/technologies/partner-sites?hl=uk"
            target="_blank">ссылке.</a>
        </p>
        <h2>С кем мы делимся вашими данными</h2>
        <p>Самостоятельно мы никому не передаем никаких личных данных.</p>
        <p>
          <a
            href="http://www.google.com/intl/ru/policies/privacy/partners/"
            target="_blank">Как Google обрабатывает информацию о пользователях, получаемую от партнеров</a>
        </p>
        <h2>Какие права вы имеете в отношении своих данных</h2>
        <p>Вы можете требовать, чтобы мы стерли любые личные данные, которые имеем в отношении вас. Это не включает данные, которые мы обязаны хранить в административных, правовых и целях безопасности.</p>
        <h2>Куда мы отправляем ваши данные</h2>
        <p>Данные могут быть проверены с помощью службы автоматического обнаружения спама.</p>
        <h2>Контактная информация</h2>
        <p>С каких-либо проблем связанных с конфиденциальностью, или запрос на удаление профиля, можете написать нам на почту:
          <a
            href="mailto:imhvost@gmail.com"
            target="_blank">imhvost@gmail.com</a>
        </p>
      </div>
      <div
        v-if="lang === 'uk'"
        class="content-text">
        <h2>Хто ми</h2>
        <p>Наша адреса сайту:
          <router-link
            exact
            tag="button"
            to="/"
            @click.native="$root.playAudio('click')">
            <span>https://www.words-mincer.top/</span>
          </router-link>
        </p>
        <h2>Які особисті дані ми збираємо та чому ми їх збираємо</h2>
        <p>Список даних, які можуть зберігатися у нас:</p>
        <ul>
          <li>Ім'я</li>
          <li>Прізвище</li>
          <li>Email</li>
          <li>Фото</li>
        </ul>
        <p>Збереження даних здійснюється за допомогою сервісу Firebase. Про політику конфіденційності даного сервісу можна ознайомитися за наступним
          <a
            href="https://policies.google.com/privacy"
            target="_blank">посиланням.</a>
        </p>
        <h2>Вбудований вміст з інших веб-сайтів</h2>
        <p>Сторінки на цьому сайті можуть містити вбудований вміст (наприклад: відео, зображення, статті тощо). Вбудований вміст з інших сайтів веде себе так само, як би користувач відвідав інший сайт.</p>
        <p>Ці сайти можуть збирати дані про вас, використовувати файли cookie, вбудувати додаткові сторонні системи відстеження та стежити за вашою взаємодією з цим вбудованим вмістом, зокрема відстежувати взаємодію з вбудованим вмістом, якщо у вас є обліковий запис і ви увійшли на цей сайт.</p>
        <h2>Аналітика</h2>
        <p>На нашому сайті використовується Google Analytics. Про політику конфіденційності даного сервісу можна ознайомитися за наступним
          <a
            href="//policies.google.com/technologies/partner-sites?hl=uk"
            target="_blank">посиланням.</a>
        </p>
        <h2>З ким ми ділимося вашими даними</h2>
        <p>Самостійно ми нікому не передає ніяких особистих даних.</p>
        <p>
          <a
            href="http://www.google.com/intl/ru/policies/privacy/partners/"
            target="_blank">Як Google обробляє інформацію про користувачів, що отримується від партнерів</a>
        </p>
        <h2>Які права ви маєте відносно своїх даних</h2>
        <p>Ви можете вимагати, щоб ми стерли будь-які особисті дані, які ми маємо щодо вас. Це не включає будь-які дані, які ми зобов'язані зберігати в адміністративних, правових та цілях безпеки.</p>
        <h2>Куди ми відправляємо ваші дані</h2>
        <p>Дані можуть бути перевірені за допомогою служби автоматичного виявлення спаму.</p>
        <h2>Контактна інформація</h2>
        <p>З будь-яких проблем пов'язаних із конфіденційністю, або запит на видалення профілю, можете написати нам на пошту:
          <a
            href="mailto:imhvost@gmail.com"
            target="_blank">imhvost@gmail.com</a>
        </p>
      </div>
    </div>
  </div>
</template>

<script>
import BackBtn from '../components/BackBtn.vue'

export default {
  components: {
    BackBtn
  },
  beforeRouteLeave (to, from, next) {
    this.$root.playAudio('click')
    next()
  },
  computed: {
    lang () {
      return this.$store.state.settings.lang
    }
  },
  methods: {
    //
  }
}

</script>

<style lang="less" scoped>
@import (less) '../less/variables.less';
.content-text{
  h2{
    font-weight:700;
    font-size:1.25rem;
  }
  &>*:not(:last-child){
    margin-bottom:1.4286rem;
  }
  ul{
    list-style:disc;
    padding-left:1.5625rem;
  }
  a{
    text-decoration:underline;
    &:hover{
      text-decoration:none;
    }
  }
}
</style>
